[
{ "title": "A theoretical framework for conversational search", "type": "conference_proceedings", "authors": [ { "first_name": "Filip", "last_name": "Radlinski" }, { "first_name": "Nick", "last_name": "Craswell" } ], "year": 2017, "source": "CHIIR 2017 - Proceedings of the 2017 Conference Human Information Interaction and Retrieval", "identifiers": { "doi": "10.1145/3020165.3020183", "isbn": "9781450346771" }, "keywords": [ "Chatbot", "Conversational Search", "Personal Agent" ], "id": "cc926bbb-d887-3376-8840-f1a32f48d6fa", "created": "2020-06-03T06:56:31.751Z", "file_attached": true, "profile_id": "dfc3b5ba-358e-3dfd-a518-2cbe487c6529", "group_id": "1268df9d-8637-354d-8a4f-3ae5cf063e8e", "last_modified": "2020-06-08T13:17:06.404Z", "read": false, "starred": false, "authored": false, "confirmed": true, "hidden": false, "folder_uuids": [ "d72a2703-a7a3-4096-975e-0578a28dd17c" ], "private_publication": false, "abstract": "This paper studies conversational approaches to information retrieval, presenting a theory and model of information interaction in a chat setting. In particular, we consider the question of what properties would be desirable for a conversational information retrieval system so that the system can allow users to answer a variety of information needs in a natural and efficient manner. We study past work on human conversations, and propose a small set of properties that taken together could measure the extent to which a system is conversational. Following this, we present a theoretical model of a conversational system that implements the properties. We describe how this system could be implemented, making the action space of an conversational search agent explicit. Our analysis of this model shows that while theoretical, the model could be practically implemented to satisfy the desirable properties presented. In doing so, we show that the properties are also feasible. Copyright is held by the owner/author(s). Publication rights licensed to ACM." }
,
{ "title": "Towards conversational search and recommendation: System Ask, user respond", "type": "journal", "authors": [ { "first_name": "Yongfeng", "last_name": "Zhang" }, { "first_name": "Xu", "last_name": "Chen" }, { "first_name": "Qingyao", "last_name": "Ai" }, { "first_name": "Liu", "last_name": "Yang" }, { "first_name": "W.", "last_name": "Bruce Croft" } ], "year": 2018, "source": "International Conference on Information and Knowledge Management, Proceedings", "identifiers": { "doi": "10.1145/3269206.3271776", "isbn": "9781450360142" }, "keywords": [ "Conversational Recommendation", "Conversational Search", "Dialog Systems", "Memory Networks", "Personalized Agent", "Product Search" ], "pages": "177-186", "id": "9169b6c0-0929-388e-872e-56b801e94d8b", "created": "2020-06-03T06:56:47.123Z", "file_attached": true, "profile_id": "feb6d51f-ec1b-3137-9424-2754bb02aeca", "group_id": "1268df9d-8637-354d-8a4f-3ae5cf063e8e", "last_modified": "2020-06-03T06:57:00.425Z", "read": true, "starred": true, "authored": false, "confirmed": true, "hidden": false, "folder_uuids": [ "d72a2703-a7a3-4096-975e-0578a28dd17c" ], "private_publication": false, "abstract": "Conversational search and recommendation based on user-system dialogs exhibit major differences from conventional search and recommendation tasks in that 1) the user and system can interact for multiple semantically coherent rounds on a task through natural language dialog, and 2) it becomes possible for the system to understand the user needs or to help users clarify their needs by asking appropriate questions from the users directly. We believe the ability to ask questions so as to actively clarify the user needs is one of the most important advantages of conversational search and recommendation. In this paper, we propose and evaluate a unified conversational search/recommendation framework, in an attempt to make the research problem doable under a standard formalization. Specifically, we propose a System Ask - User Respond (SAUR) paradigm for conversational search, define the major components of the paradigm, and design a unified implementation of the framework for product search and recommendation in e-commerce. To accomplish this, we propose the Multi-Memory Network (MMN) architecture, which can be trained based on large-scale collections of user reviews in e-commerce. The system is capable of asking aspect-based questions in the right order so as to understand the user needs, while (personalized) search is conducted during the conversation, and results are provided when the system feels confident. Experiments on real-world user purchasing data verified the advantages of conversational search and recommendation against conventional search and recommendation algorithms in terms of standard evaluation measures such as NDCG." }
,
{ "title": "Asking clarifying questions in open-domain information-seeking conversations", "type": "journal", "authors": [ { "first_name": "Mohammad", "last_name": "Aliannejadi" }, { "first_name": "Fabio", "last_name": "Crestani" }, { "first_name": "Hamed", "last_name": "Zamani" }, { "first_name": "W.", "last_name": "Bruce Croft" } ], "year": 2019, "source": "SIGIR 2019 - Proceedings of the 42nd International ACM SIGIR Conference on Research and Development in Information Retrieval", "identifiers": { "arxiv": "1907.06554", "doi": "10.1145/3331184.3331265", "isbn": "9781450361729" }, "pages": "475-484", "id": "99249cb4-a746-3323-ac48-4c8ed84f42e2", "created": "2020-06-03T06:56:47.161Z", "file_attached": true, "profile_id": "feb6d51f-ec1b-3137-9424-2754bb02aeca", "group_id": "1268df9d-8637-354d-8a4f-3ae5cf063e8e", "last_modified": "2020-06-03T06:57:04.972Z", "read": true, "starred": false, "authored": false, "confirmed": true, "hidden": false, "folder_uuids": [ "d72a2703-a7a3-4096-975e-0578a28dd17c" ], "private_publication": false, "abstract": "Users often fail to formulate their complex information needs in a single query. As a consequence, they may need to scan multiple result pages or reformulate their queries, which may be a frustrating experience. Alternatively, systems can improve user satisfaction by proactively asking questions of the users to clarify their information needs. Asking clarifying questions is especially important in conversational systems since they can only return a limited number of (often only one) result(s). In this paper, we formulate the task of asking clarifying questions in open-domain information-seeking conversational systems. To this end, we propose an offline evaluation methodology for the task and collect a dataset, called Qulac, through crowdsourcing. Our dataset is built on top of the TREC Web Track 2009-2012 data and consists of over 10K question-answer pairs for 198 TREC topics with 762 facets. Our experiments on an oracle model demonstrate that asking only one good question leads to over 170% retrieval performance improvement in terms of P@1, which clearly demonstrates the potential impact of the task. We further propose a retrieval framework consisting of three components: question retrieval, question selection, and document retrieval. In particular, our question selection model takes into account the original query and previous question-answer interactions while selecting the next question. Our model significantly outperforms competitive baselines. To foster research in this area, we have made Qulac publicly available." }
,
{ "title": "Coached Conversational Preference Elicitation: A Case Study in Understanding Movie Preferences", "type": "journal", "authors": [ { "first_name": "Filip", "last_name": "Radlinski" }, { "first_name": "Krisztian", "last_name": "Balog" }, { "first_name": "Bill", "last_name": "Byrne" }, { "first_name": "Karthik", "last_name": "Krishnamoorthi" } ], "year": 2019, "identifiers": { "doi": "10.18653/v1/w19-5941" }, "pages": "353-360", "id": "c2c69d35-f039-3545-bbcb-75851dfd742a", "created": "2020-06-03T06:56:47.434Z", "file_attached": true, "profile_id": "feb6d51f-ec1b-3137-9424-2754bb02aeca", "group_id": "1268df9d-8637-354d-8a4f-3ae5cf063e8e", "last_modified": "2020-06-03T06:57:01.090Z", "read": true, "starred": false, "authored": false, "confirmed": true, "hidden": false, "notes": "基于现在很多对话推荐系统问用户问题都是给出了几个既定的答案，而不能让用户开放性回答的现状，建立了一个数据集。能够认识到不设限制的前提下用户会往哪个方向去回答，为以后推荐系统设定问题做参考。（2019）", "folder_uuids": [ "d72a2703-a7a3-4096-975e-0578a28dd17c" ], "private_publication": false, "abstract": "Conversational recommendation has recently attracted significant attention. As systems must understand users' preferences , training them has called for conversational corpora, typically derived from task-oriented conversations. We observe that such corpora often do not reflect how people naturally describe preferences. We present a new approach to obtaining user preferences in dialogue: Coached Conversational Preference Elicitation. It allows collection of natural yet structured conversational preferences. Studying the dialogues in one domain, we present a brief quantitative analysis of how people describe movie preferences at scale. Demonstrating the methodology, we release the CCPE-M dataset to the community with over 500 movie preference dialogues expressing over 10,000 preferences. 1" }
,
{ "title": "“I’m looking for something like ...”: Combining Narratives and Example Items for Narrative-driven Book Recommendation", "type": "journal", "authors": [ { "first_name": "Toine", "last_name": "Bogers" }, { "first_name": "Marijn", "last_name": "Koolen" } ], "year": 2018, "source": "CEUR Workshop Proceedings", "identifiers": { "issn": "16130073" }, "keywords": [ "Book recommendation", "Example-driven recommendation", "Narrative-driven recommendation" ], "pages": "35-43", "volume": "2290", "id": "ea753028-3d33-3bac-ab16-c93045252236", "created": "2020-06-03T06:56:47.470Z", "file_attached": true, "profile_id": "feb6d51f-ec1b-3137-9424-2754bb02aeca", "group_id": "1268df9d-8637-354d-8a4f-3ae5cf063e8e", "last_modified": "2020-06-03T06:57:02.208Z", "read": true, "starred": false, "authored": false, "confirmed": true, "hidden": false, "folder_uuids": [ "d72a2703-a7a3-4096-975e-0578a28dd17c" ], "private_publication": false, "abstract": "Current-generation recommendation algorithms are often focused on generic ratings prediction and item ranking tasks based on a user’s past preferences. However, many recommendations are more complex with specific criteria and constraints on which items are relevant. This paper focuses on a particular type of complex recommendation needs: narrative-driven recommendation, where users describe their needs in short narratives, often with one or more example items that fit that need, against a background of historical preferences that may not be spelled out in the narrative, but do play a role in their considerations. Previous work has shown that numerous examples of such complex needs exist on the Web, yet current-generation systems offer limited to no support for these needs. In this paer, we focus on narrative-driven book recommendation in the context of LibraryThing users posting recommendation requests in the discussion forums. We propose several new algorithms that take advantage of these narratives and example items as well as hybrid systems, the majority of which significantly outperform classic collaborative filtering. We show that narrative-driven recommendation is indeed a complex scenario that requires further study. Our findings have consequences for system design and development not only in the book domain, but also in other domains where users express focused recommendation needs, such as movies, television, games, and music." }
,
{ "title": "Dialogue based recommender system that flexibly mixes utterances and recommendations", "type": "journal", "authors": [ { "first_name": "Daisuke", "last_name": "Tsumita" }, { "first_name": "Tomohiro", "last_name": "Takagi" } ], "year": 2019, "source": "Proceedings - 2019 IEEE/WIC/ACM International Conference on Web Intelligence, WI 2019", "identifiers": { "doi": "10.1145/3350546.3352500", "isbn": "9781450369343" }, "keywords": [ "Deep reinforcement learning", "Dialogue system", "End-to-end memory networks", "Recommender system" ], "pages": "51-58", "id": "f420c924-f9a4-31d7-861a-97141a357d9e", "created": "2020-06-03T06:56:47.590Z", "file_attached": true, "profile_id": "feb6d51f-ec1b-3137-9424-2754bb02aeca", "group_id": "1268df9d-8637-354d-8a4f-3ae5cf063e8e", "last_modified": "2020-06-03T06:57:03.605Z", "read": true, "starred": true, "authored": false, "confirmed": true, "hidden": false, "folder_uuids": [ "d72a2703-a7a3-4096-975e-0578a28dd17c" ], "private_publication": false, "abstract": "Much of the prior research in the recommendations through dialogue separate dialogue and recommendations. However, since the accuracy of the recommendations themselves is not necessarily high, recommendation results rarely meet user needs. However, as human we can find the solutions that satisfy users by appropriately repeating the cycle of checking mismatched reasons and making another recommendations in our conversations. In this paper, we propose a system for leveraging a dialogue strategy for reinforcement learning using recommendation results based on user utterances. We constructed a dialogue system to perform adaptive behavior that naturally incorporates recommendations into conversation with users." }
,
{ "title": "Towards deep conversational recommendations", "type": "journal", "authors": [ { "first_name": "Raymond", "last_name": "Li" }, { "first_name": "Samira Ebrahimi", "last_name": "Kahou" }, { "first_name": "Hannes", "last_name": "Schulz" }, { "first_name": "Vincent", "last_name": "Michalski" }, { "first_name": "Laurent", "last_name": "Charlin" }, { "first_name": "Chris", "last_name": "Pal" } ], "year": 2018, "source": "Advances in Neural Information Processing Systems", "identifiers": { "arxiv": "1812.07617", "issn": "10495258" }, "pages": "9725-9735", "volume": "2018-Decem", "issue": "NeurIPS", "id": "f7b06bd9-9fdd-3526-90b6-81fcda97bd86", "created": "2020-06-03T06:56:47.598Z", "file_attached": true, "profile_id": "feb6d51f-ec1b-3137-9424-2754bb02aeca", "group_id": "1268df9d-8637-354d-8a4f-3ae5cf063e8e", "last_modified": "2020-06-03T06:56:56.379Z", "read": true, "starred": false, "authored": false, "confirmed": true, "hidden": false, "folder_uuids": [ "d72a2703-a7a3-4096-975e-0578a28dd17c" ], "private_publication": false, "abstract": "There has been growing interest in using neural networks and deep learning techniques to create dialogue systems. Conversational recommendation is an interesting setting for the scientific exploration of dialogue with natural language as the associated discourse involves goal-driven dialogue that often transforms naturally into more free-form chat. This paper provides two contributions. First, until now there has been no publicly available large-scale dataset consisting of real-world dialogues centered around recommendations. To address this issue and to facilitate our exploration here, we have collected REDIAL, a dataset consisting of over 10,000 conversations centered around the theme of providing movie recommendations. We make this data available to the community for further research. Second, we use this dataset to explore multiple facets of conversational recommendations. In particular we explore new neural architectures, mechanisms, and methods suitable for composing conversational recommendation systems. Our dataset allows us to systematically probe model sub-components addressing different parts of the overall problem domain ranging from: sentiment analysis and cold-start recommendation generation to detailed aspects of how natural language is used in this setting in the real world. We combine such sub-components into a full-blown dialogue system and examine its behavior." }
,
{ "title": "Conversational recommender system", "type": "journal", "authors": [ { "first_name": "Yueming", "last_name": "Sun" }, { "first_name": "Yi", "last_name": "Zhang" } ], "year": 2018, "source": "41st International ACM SIGIR Conference on Research and Development in Information Retrieval, SIGIR 2018", "identifiers": { "isbn": "9781450356572", "arxiv": "1806.03277", "doi": "10.1145/3209978.3210002" }, "keywords": [ "Dialogue system", "Recommender system", "Reinforcement learning" ], "pages": "235-244", "id": "3453bcb2-955f-3991-b2c5-4d94721aed05", "created": "2020-06-03T06:56:47.608Z", "file_attached": true, "profile_id": "feb6d51f-ec1b-3137-9424-2754bb02aeca", "group_id": "1268df9d-8637-354d-8a4f-3ae5cf063e8e", "last_modified": "2020-06-03T06:56:59.122Z", "read": true, "starred": true, "authored": false, "confirmed": true, "hidden": false, "folder_uuids": [ "d72a2703-a7a3-4096-975e-0578a28dd17c" ], "private_publication": false, "abstract": "A personalized conversational sales agent could have much commercial potential. E-commerce companies such as Amazon, eBay, JD, Alibaba etc. are piloting such kind of agents with their users. However, the research on this topic is very limited and existing solutions are either based on single round adhoc search engine or traditional multi round dialog system. They usually only utilize user inputs in the current session, ignoring users' long term preferences. On the other hand, it is well known that sales conversion rate can be greatly improved based on recommender systems, which learn user preferences based on past purchasing behavior and optimize business oriented metrics such as conversion rate or expected revenue. In this work, we propose to integrate research in dialog systems and recommender systems into a novel and unified deep reinforcement learning framework to build a personalized conversational recommendation agent that optimizes a per session based utility function. In particular, we propose to represent a user conversation history as a semi-structured user query with facet-value pairs. This query is generated and updated by belief tracker that analyzes natural language utterances of user at each step. We propose a set of machine actions tailored for recommendation agents and train a deep policy network to decide which action (i.e. asking for the value of a facet or making a recommendation) the agent should take at each step. We train a personalized recommendation model that uses both the user's past ratings and user query collected in the current conversational session when making rating predictions and generating recommendations. Such a conversational system often tries to collect user preferences by asking questions. Once enough user preference is collected, it makes personalized recommendations to the user. We perform both simulation experiments and real online user studies to demonstrate the effectiveness of the proposed framework." }
,
{ "title": "Towards conversational recommender systems", "type": "journal", "authors": [ { "first_name": "Konstantina", "last_name": "Christakopoulou" }, { "first_name": "Filip", "last_name": "Radlinski" }, { "first_name": "Katja", "last_name": "Hofmann" } ], "year": 2016, "source": "Proceedings of the ACM SIGKDD International Conference on Knowledge Discovery and Data Mining", "identifiers": { "doi": "10.1145/2939672.2939746", "isbn": "9781450342322" }, "keywords": [ "Cold-start", "Online learning", "Recommender systems" ], "pages": "815-824", "volume": "13-17-Augu", "issue": "3", "id": "7f02fd63-3b32-3b1b-b1a1-d29cca51d42c", "created": "2020-06-03T06:56:47.637Z", "file_attached": true, "profile_id": "feb6d51f-ec1b-3137-9424-2754bb02aeca", "group_id": "1268df9d-8637-354d-8a4f-3ae5cf063e8e", "last_modified": "2020-06-03T06:56:58.055Z", "read": true, "starred": false, "authored": false, "confirmed": true, "hidden": false, "folder_uuids": [ "d72a2703-a7a3-4096-975e-0578a28dd17c" ], "private_publication": false, "abstract": "People often ask others for restaurant recommendations as a way to discover new dining experiences. This makes restaurant recommendation an exciting scenario for recommender systems and has led to substantial research in this area. However, most such systems behave very differently from a human when asked for a recommendation. The goal of this paper is to begin to reduce this gap. In particular, humans can quickly establish preferences when asked to make a recommendation for someone they do not know. We address this cold-start recommendation problem in an online learning setting. We develop a preference elicitation framework to identify which questions to ask a new user to quickly learn their preferences. Taking advantage of latent structure in the recommendation space using a probabilistic latent factor model, our experiments with both synthetic and real world data compare different types of feedback and question selection strategies. We find that our framework can make very effective use of online user feedback, improving personalized recommendations over a static model by 25% after asking only 2 questions. Our results demonstrate dramatic benefits of starting from offline embeddings, and highlight the benefit of bandit-based explore-exploit strategies in this setting." }
,
{ "title": "Response ranking with deep matching networks and external knowledge in information-seeking conversation systems", "type": "conference_proceedings", "authors": [ { "first_name": "Liu", "last_name": "Yang" }, { "first_name": "Minghui", "last_name": "Qiu" }, { "first_name": "Chen", "last_name": "Qu" }, { "first_name": "Jiafeng", "last_name": "Guo" }, { "first_name": "Yongfeng", "last_name": "Zhang" }, { "first_name": "W. Bruce", "last_name": "Croft" }, { "first_name": "Jun", "last_name": "Huang" }, { "first_name": "Haiqing", "last_name": "Chen" } ], "year": 2018, "source": "41st International ACM SIGIR Conference on Research and Development in Information Retrieval, SIGIR 2018", "identifiers": { "isbn": "9781450356572", "arxiv": "1805.00188", "doi": "10.1145/3209978.3210011" }, "keywords": [ "Conversational models", "Deep learning", "External knowledge", "Question answering" ], "id": "9d376847-ff7e-3aa7-b88e-8c24feafcf2a", "created": "2020-06-03T07:04:48.777Z", "file_attached": false, "profile_id": "fa188c70-d113-3400-884f-45bce5a71378", "group_id": "1268df9d-8637-354d-8a4f-3ae5cf063e8e", "last_modified": "2020-06-03T07:04:52.150Z", "read": false, "starred": false, "authored": false, "confirmed": true, "hidden": false, "folder_uuids": [ "d72a2703-a7a3-4096-975e-0578a28dd17c" ], "private_publication": false, "abstract": "Intelligent personal assistant systems with either text-based or voice-based conversational interfaces are becoming increasingly popular around the world. Retrieval-based conversation models have the advantages of returning fluent and informative responses. Most existing studies in this area are on open domain ''chit-chat'' conversations or task / transaction oriented conversations. More research is needed for information-seeking conversations. There is also a lack of modeling external knowledge beyond the dialog utterances among current conversational models. In this paper, we propose a learning framework on the top of deep neural matching networks that leverages external knowledge for response ranking in information-seeking conversation systems. We incorporate external knowledge into deep neural models with pseudo-relevance feedback and QA correspondence knowledge distillation. Extensive experiments with three information-seeking conversation data sets including both open benchmarks and commercial data show that, our methods outperform various baseline methods including several deep text matching models and the state-of-the-art method on response selection in multi-turn conversations. We also perform analysis over different response types, model variations and ranking examples. Our models and research findings provide new insights on how to utilize external knowledge with deep neural models for response selection and have implications for the design of the next generation of information-seeking conversation systems." }
,
{ "title": "Exploring conversational search with humans, assistants, and wizards", "type": "conference_proceedings", "authors": [ { "first_name": "Alexandra", "last_name": "Vtyurina" }, { "first_name": "Denis", "last_name": "Savenkov" }, { "first_name": "Eugene", "last_name": "Agichtein" }, { "first_name": "Charles L.A.", "last_name": "Clarke" } ], "year": 2017, "source": "Conference on Human Factors in Computing Systems - Proceedings", "identifiers": { "doi": "10.1145/3027063.3053175", "isbn": "9781450346566" }, "keywords": [ "Conversational search", "Intelligent assistants" ], "id": "c2f5fd54-b60b-3f5c-877e-a216848b623d", "created": "2020-06-03T07:04:48.780Z", "file_attached": false, "profile_id": "fa188c70-d113-3400-884f-45bce5a71378", "group_id": "1268df9d-8637-354d-8a4f-3ae5cf063e8e", "last_modified": "2020-06-03T07:04:50.370Z", "read": false, "starred": false, "authored": false, "confirmed": true, "hidden": false, "folder_uuids": [ "d72a2703-a7a3-4096-975e-0578a28dd17c" ], "private_publication": false, "abstract": "Chatbots and conversational assistants are becoming increasingly popular. However, for information seeking scenarios, these systems still have very limited conversational abilities, and primarily serve as proxies to existing web search engines. In this work, we ask: what would conversational search look like with a truly intelligent assistant? To begin answering this question empirically, we conduct a user study, in which 21 participants are each given 3 information seeking tasks to solve using a text-based chat interface. To complete each task, participants conversed with three conversational agents: an existing commercial system, a human expert, and a perceived experimental automatic system, backed by a human \"wizard\" behind the curtain. The observations and insights of our study help us understand the aspirations of users and the limitations of the current conversational agents - and to sharpen a frontier of work required to improve conversational assistants for search scenarios." }
,
{ "title": "User intent prediction in information-seeking conversations", "type": "conference_proceedings", "authors": [ { "first_name": "Chen", "last_name": "Qu" }, { "first_name": "Yongfeng", "last_name": "Zhang" }, { "first_name": "Liu", "last_name": "Yang" }, { "first_name": "Johanne R.", "last_name": "Trippas" }, { "first_name": "W.", "last_name": "Bruce Croft" }, { "first_name": "Minghui", "last_name": "Qiu" } ], "year": 2019, "source": "CHIIR 2019 - Proceedings of the 2019 Conference on Human Information Interaction and Retrieval", "identifiers": { "arxiv": "1901.03489", "doi": "10.1145/3295750.3298924", "isbn": "9781450360258" }, "keywords": [ "Conversational search", "Information-seeking conversations", "Multi-turn question answering", "User intent prediction" ], "id": "44106443-7ee1-394a-a283-ac5ece56137f", "created": "2020-06-03T07:04:48.787Z", "file_attached": true, "profile_id": "fa188c70-d113-3400-884f-45bce5a71378", "group_id": "1268df9d-8637-354d-8a4f-3ae5cf063e8e", "last_modified": "2020-06-09T00:39:57.100Z", "read": false, "starred": false, "authored": false, "confirmed": true, "hidden": false, "folder_uuids": [ "d72a2703-a7a3-4096-975e-0578a28dd17c" ], "private_publication": false, "abstract": "Conversational assistants are being progressively adopted by the general population. However, they are not capable of handling complicated information-seeking tasks that involve multiple turns of information exchange. Due to the limited communication bandwidth in conversational search, it is important for conversational assistants to accurately detect and predict user intent in information-seeking conversations. In this paper, we investigate two aspects of user intent prediction in an information-seeking setting. First, we extract features based on the content, structural, and sentiment characteristics of a given utterance, and use classic machine learning methods to perform user intent prediction. We then conduct an in-depth feature importance analysis to identify key features in this prediction task. We find that structural features contribute most to the prediction performance. Given this finding, we construct neural classifiers to incorporate context information and achieve better performance without feature engineering. Our findings can provide insights into the important factors and effective methods of user intent prediction in information-seeking conversations." }
,
{ "title": "Style and alignment in information-seeking conversation", "type": "conference_proceedings", "authors": [ { "first_name": "Paul", "last_name": "Thomas" }, { "first_name": "Mary", "last_name": "Czerwinski" }, { "first_name": "Daniel", "last_name": "McDuf" }, { "first_name": "Nick", "last_name": "Craswell" }, { "first_name": "Gloria", "last_name": "Mark" } ], "year": 2018, "source": "CHIIR 2018 - Proceedings of the 2018 Conference on Human Information Interaction and Retrieval", "identifiers": { "doi": "10.1145/3176349.3176388", "isbn": "9781450349253" }, "id": "cf2a7e85-89de-3a5f-a499-38cffddc69ed", "created": "2020-06-03T07:04:49.063Z", "file_attached": false, "profile_id": "fa188c70-d113-3400-884f-45bce5a71378", "group_id": "1268df9d-8637-354d-8a4f-3ae5cf063e8e", "last_modified": "2020-06-03T07:04:51.575Z", "read": false, "starred": false, "authored": false, "confirmed": true, "hidden": false, "folder_uuids": [ "d72a2703-a7a3-4096-975e-0578a28dd17c" ], "private_publication": false, "abstract": "Analysis of casual chit-chat indicates that diferences in conversational styleÐthe way things are saidÐcan signiicantly impact a participants’ impressions of the conversation and of each other. However, prior work has not systematically analyzed how important style is in task-oriented, information-seeking exchanges of the sort we might have with a conversational search agent. We examine recordings from the MISC data set, where pairs of łusersž and łintermediariesž collaborate on information-seeking tasks, and look for indications of style which can be computed at scale. We ind that stylistic markers identiied by Tannen in casual chat do exist in information-seeking dialogue, and that participants can be arranged along a single stylistic dimension: łconsideratež to łinvolvedž. This labelling for style needs no manual intervention. Furthermore, we ind that there is no clear best style; but that diferences in style, previously thought to impede communication, are only a problem for shorter tasks. This result is likely due to alignment of conversational style over the course of an interaction." }
,
{ "title": "Modelling information needs in collaborative search conversations", "type": "conference_proceedings", "authors": [ { "first_name": "Sosuke", "last_name": "Shiga" }, { "first_name": "Hideo", "last_name": "Joho" }, { "first_name": "Roi", "last_name": "Blanco" }, { "first_name": "Johanne R.", "last_name": "Trippas" }, { "first_name": "Mark", "last_name": "Sanderson" } ], "year": 2017, "source": "SIGIR 2017 - Proceedings of the 40th International ACM SIGIR Conference on Research and Development in Information Retrieval", "identifiers": { "doi": "10.1145/3077136.3080787", "isbn": "9781450350228" }, "keywords": [ "Collaborative Search", "Conversation", "Information Needs" ], "id": "16cf60a5-2ae2-3548-82ea-5b5da36cf5ab", "created": "2020-06-03T07:04:49.079Z", "file_attached": false, "profile_id": "fa188c70-d113-3400-884f-45bce5a71378", "group_id": "1268df9d-8637-354d-8a4f-3ae5cf063e8e", "last_modified": "2020-06-03T07:04:53.251Z", "read": false, "starred": false, "authored": false, "confirmed": true, "hidden": false, "folder_uuids": [ "d72a2703-a7a3-4096-975e-0578a28dd17c" ], "private_publication": false, "abstract": "The increase of voice-based interaction has changed the way people seek information, making search more conversational. Development of effective conversational approaches to search requires better understanding of how people express information needs in dialogue. This paper describes the creation and examination of over 32K spoken utterances collected during 34 hours of collaborative search tasks. The contribution of this work is three-fold. First, we propose a model of conversational information needs (CINs) based on a synthesis of relevant theories in Information Seeking and Retrieval. Second, we show several behavioural patterns of CINs based on the proposed model. Third, we identify effective feature groups that may be useful for detecting CINs categories from conversations. This paper concludes with a discussion of how these findings can facilitate advance of conversational search applications." }
,
{ "title": "MISC: A data set of information-seeking conversations", "type": "journal", "authors": [ { "first_name": "Paul", "last_name": "Thomas" }, { "first_name": "Daniel", "last_name": "McDuff" }, { "first_name": "Mary", "last_name": "Czerwinski" }, { "first_name": "Nick", "last_name": "Craswell" } ], "year": 2017, "source": "Proceedings ofIn- ternational Workshop on Conversational Approaches to Information Retrieval (CAIR’17)", "identifiers": { "isbn": "9781267645463" }, "keywords": [ "0543:Civil engineering", "0709:Transportation planning", "Applied sciences", "Civil engineering", "Land development", "Public transit", "Social sciences", "Transit revenue", "Transportation planning" ], "id": "06a499fb-6b05-37f7-91d3-db2aaa296e1f", "created": "2020-06-03T07:04:49.080Z", "file_attached": false, "profile_id": "fa188c70-d113-3400-884f-45bce5a71378", "group_id": "1268df9d-8637-354d-8a4f-3ae5cf063e8e", "last_modified": "2020-06-03T07:04:52.707Z", "read": false, "starred": false, "authored": false, "confirmed": true, "hidden": false, "folder_uuids": [ "d72a2703-a7a3-4096-975e-0578a28dd17c" ], "private_publication": false, "abstract": "Conversational interfaces to information retrieval systems, via soo-ware agents such as Siri or Cortana, are of commercial and research interest. To build or evaluate these sooware interfaces it is natural to consider how people act in the same role, but there is liile public, data on interactions with intermediaries for web tasks. We introduce the Microsoo Information-Seeking Conversation data (MISC), a set of recordings of information-seeking conver-sations between human \" seekers \" and \" intermediaries \" . MISC in-cludes audio and video signals; transcripts of conversation; aaectual and physiological signals; recordings of search and other computer use; and post-task surveys on emotion, success, and eeort. We hope that these recordings will support conversational retrieval inter-faces both in engineering (how can we make \" natural \" systems?) and evaluation (what does a \" good \" conversation look like?)." }
,
{ "title": "Analyzing and characterizing user intent in information-seeking conversations", "type": "conference_proceedings", "authors": [ { "first_name": "Chen", "last_name": "Qu" }, { "first_name": "Liu", "last_name": "Yang" }, { "first_name": "W. Bruce", "last_name": "Croft" }, { "first_name": "Johanne R.", "last_name": "Trippas" }, { "first_name": "Yongfeng", "last_name": "Zhang" }, { "first_name": "Minghui", "last_name": "Qiu" } ], "year": 2018, "source": "41st International ACM SIGIR Conference on Research and Development in Information Retrieval, SIGIR 2018", "identifiers": { "arxiv": "1804.08759", "doi": "10.1145/3209978.3210124", "isbn": "9781450356572" }, "keywords": [ "Conversational search", "Information-seeking", "User intent" ], "id": "97b6e016-8e61-3ae6-936d-59572e0aca6f", "created": "2020-06-03T07:04:49.240Z", "file_attached": false, "profile_id": "fa188c70-d113-3400-884f-45bce5a71378", "group_id": "1268df9d-8637-354d-8a4f-3ae5cf063e8e", "last_modified": "2020-06-03T07:04:49.813Z", "read": false, "starred": false, "authored": false, "confirmed": true, "hidden": false, "folder_uuids": [ "d72a2703-a7a3-4096-975e-0578a28dd17c" ], "private_publication": false, "abstract": "Understanding and characterizing how people interact in information-seeking conversations is crucial in developing conversational search systems. In this paper, we introduce a new dataset designed for this purpose and use it to analyze information-seeking conversations by user intent distribution, co-occurrence, and flow patterns. The MSDialog dataset is a labeled dialog dataset of question answering (QA) interactions between information seekers and providers from an online forum on Microsoft products. The dataset contains more than 2,000 multi-turn QA dialogs with 10,000 utterances that are annotated with user intent on the utterance level. Annotations were done using crowdsourcing. With MSDialog, we find some highly recurring patterns in user intent during an information-seeking process. They could be useful for designing conversational search systems. We will make our dataset freely available to encourage exploration of information-seeking conversation models." }
,
{ "title": "Generic Intent Representation in Web Search", "type": "conference_proceedings", "authors": [ { "first_name": "Hongfei", "last_name": "Zhang" }, { "first_name": "Xia", "last_name": "Song" }, { "first_name": "Chenyan", "last_name": "Xiong" }, { "first_name": "Corby", "last_name": "Rosset" }, { "first_name": "Paul N", "last_name": "Bennett" }, { "first_name": "Nick", "last_name": "Craswell" }, { "first_name": "Saurabh", "last_name": "Tiwary" } ], "year": 2019, "source": "Proceedings of the 42nd International ACM SIGIR Conference on Research and Development in Information Retrieval", "identifiers": { "doi": "10.1145/3331184.3331198", "isbn": "9781450361729" }, "keywords": [ "generic intent representation", "query embedding", "user intent" ], "pages": "65–74", "websites": [ "https://doi.org/10.1145/3331184.3331198" ], "publisher": "Association for Computing Machinery", "city": "New York, NY, USA", "series": "SIGIR’19", "id": "cfdc3ed3-4abd-3a17-894a-bddaf2f1c7b7", "created": "2020-06-03T23:12:54.895Z", "file_attached": false, "profile_id": "dfc3b5ba-358e-3dfd-a518-2cbe487c6529", "group_id": "1268df9d-8637-354d-8a4f-3ae5cf063e8e", "last_modified": "2020-06-03T23:12:55.559Z", "read": false, "starred": false, "authored": false, "confirmed": true, "hidden": false, "citation_key": "10.1145/3331184.3331198", "source_type": "inproceedings", "folder_uuids": [ "d72a2703-a7a3-4096-975e-0578a28dd17c" ], "private_publication": false }
,
{ "title": "Query Resolution for Conversational Search with Limited Supervision", "type": "conference_proceedings", "authors": [ { "first_name": "Nikos", "last_name": "Voskarides" }, { "first_name": "Dan", "last_name": "Li" }, { "first_name": "Pengjie", "last_name": "Ren" }, { "first_name": "Evangelos", "last_name": "Kanoulas" }, { "first_name": "Maarten", "last_name": "de Rijke" } ], "year": 2020, "source": "Arxiv.org", "identifiers": { "arxiv": "2005.11723", "doi": "10.1145/3397271.3401130", "isbn": "9781450380164" }, "keywords": [ "acm reference format", "and maarten", "conversational search", "dan li", "evangelos kanoulas", "nikos voskarides", "pengjie ren", "query resolution" ], "websites": [ "http://arxiv.org/abs/2005.11723%0Ahttp://dx.doi.org/10.1145/3397271.3401130" ], "id": "bac44079-8093-3ab8-9550-4685d95b9b96", "created": "2020-06-09T06:31:54.398Z", "file_attached": true, "profile_id": "20d24ba4-5372-3e76-923f-acba7b49aee2", "group_id": "1268df9d-8637-354d-8a4f-3ae5cf063e8e", "last_modified": "2020-06-10T05:55:47.854Z", "read": false, "starred": false, "authored": false, "confirmed": true, "hidden": false, "folder_uuids": [ "d72a2703-a7a3-4096-975e-0578a28dd17c" ], "private_publication": false, "abstract": "In this work we focus on multi-turn passage retrieval as a crucial component of conversational search. One of the key challenges in multi-turn passage retrieval comes from the fact that the current turn query is often underspecified due to zero anaphora, topic change, or topic return. Context from the conversational history can be used to arrive at a better expression of the current turn query, defined as the task of query resolution. In this paper, we model the query resolution task as a binary term classification problem: for each term appearing in the previous turns of the conversation decide whether to add it to the current turn query or not. We propose QuReTeC (Query Resolution by Term Classification), a neural query resolution model based on bidirectional transformers. We propose a distant supervision method to automatically generate training data by using query-passage relevance labels. Such labels are often readily available in a collection either as human annotations or inferred from user interactions. We show that QuReTeC outperforms state-of-the-art models, and furthermore, that our distant supervision method can be used to substantially reduce the amount of human-curated data required to train QuReTeC. We incorporate QuReTeC in a multi-turn, multi-stage passage retrieval architecture and demonstrate its effectiveness on the TREC CAsT dataset." }
,
{ "title": "Generating Clarifying Questions for Information Retrieval", "type": "conference_proceedings", "authors": [ { "first_name": "Hamed", "last_name": "Zamani" }, { "first_name": "Susan", "last_name": "Dumais" }, { "first_name": "Nick", "last_name": "Craswell" }, { "first_name": "Paul", "last_name": "Bennett" }, { "first_name": "Gord", "last_name": "Lueck" } ], "year": 2020, "source": "WWW '20: Proceedings of The Web Conference 2020", "identifiers": { "doi": "10.1145/3366423.3380126", "isbn": "9781450370233" }, "pages": "418-428", "volume": "2", "id": "bc71cfc3-66ff-3258-9cbe-f054a6d087fe", "created": "2020-06-09T06:31:54.402Z", "file_attached": true, "profile_id": "20d24ba4-5372-3e76-923f-acba7b49aee2", "group_id": "1268df9d-8637-354d-8a4f-3ae5cf063e8e", "last_modified": "2020-06-09T06:32:23.089Z", "read": false, "starred": false, "authored": false, "confirmed": true, "hidden": false, "folder_uuids": [ "d72a2703-a7a3-4096-975e-0578a28dd17c", "ecf99fe3-98c0-46c5-8869-ccec331e578b" ], "private_publication": false, "abstract": "Search queries are often short, and the underlying user intent may be ambiguous. This makes it challenging for search engines to predict possible intents, only one of which may pertain to the current user. To address this issue, search engines often diversify the result list and present documents relevant to multiple intents of the query. An alternative approach is to ask the user a question to clarify her information need. Asking clarifying questions is particularly important for scenarios with \"limited bandwidth\" interfaces, such as speech-only and small-screen devices. In addition, our user studies and large-scale online experiments show that asking clarifying questions is also useful in web search. Although some recent studies have pointed out the importance of asking clarifying questions, generating them for open-domain search tasks remains unstudied and is the focus of this paper. Lack of training data even within major search engines for this task makes it challenging. To mitigate this issue, we first identify a taxonomy of clarification for open-domain search queries by analyzing large-scale query reformulation data sampled from Bing search logs. This taxonomy leads us to a set of question templates and a simple yet effective slot filling algorithm. We further use this model as a source of weak supervision to automatically generate clarifying questions for training. Furthermore , we propose supervised and reinforcement learning models for generating clarifying questions learned from weak supervision data. We also investigate methods for generating candidate answers for each clarifying question, so users can select from a set of pre-defined answers. Human evaluation of the clarifying questions and candidate answers for hundreds of search queries demonstrates the effectiveness of the proposed solutions." }
,
{ "title": "Leading Conversational Search by Suggesting Useful Questions", "type": "conference_proceedings", "authors": [ { "first_name": "Corbin", "last_name": "Rosset" }, { "first_name": "Chenyan", "last_name": "Xiong" }, { "first_name": "Xia", "last_name": "Song" }, { "first_name": "Daniel", "last_name": "Campos" }, { "first_name": "Nick", "last_name": "Craswell" }, { "first_name": "Saurabh", "last_name": "Tiwary" }, { "first_name": "Paul", "last_name": "Bennett" } ], "year": 2020, "source": "Arxiv.org", "identifiers": { "doi": "10.1145/3366423.3380193", "isbn": "9781450370233" }, "keywords": [ "a search engine must", "ask natural language questions", "be handled more", "effectively", "experiencing search engine failures", "now that they can", "on natural language questions", "queries after years of", "second", "to be truly conversational", "users to", "we must subtly encourage" ], "pages": "1160-1170", "volume": "2", "id": "170f1863-3722-3039-a1d4-cf006f009010", "created": "2020-06-09T06:31:54.404Z", "file_attached": true, "profile_id": "20d24ba4-5372-3e76-923f-acba7b49aee2", "group_id": "1268df9d-8637-354d-8a4f-3ae5cf063e8e", "last_modified": "2020-06-09T06:32:16.706Z", "read": false, "starred": false, "authored": false, "confirmed": true, "hidden": false, "folder_uuids": [ "d72a2703-a7a3-4096-975e-0578a28dd17c", "ecf99fe3-98c0-46c5-8869-ccec331e578b" ], "private_publication": false }
]
